       01 background-data.
         78 MAX-DOTS VALUE 50.
         05 rand-n USAGE COMP-1.
         05 dot-x PIC 9(4) OCCURS MAX-DOTS TIMES.
         05 dot-y PIC 9(4) OCCURS MAX-DOTS TIMES.
         05 dot-i PIC 99.