       01 player-data.
         78 PLAYER-MOVEMENT VALUE 5.
         05 moving-key-1 PIC 9.
         05 moving-key-2 PIC 9.
         05 player-rect PIC 9.
         05 player-x PIC 9(3) VALUE 300.
